Documents/СнятиеДисциплинарногоВзыскания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СнятиеДисциплинарногоВзыскания</Name>
			<BasedOn>
				<xr:Item>Document.ДисциплинарноеВзыскание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДисциплинарноеВзыскание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСнятия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДисциплинарноеВзыскание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДисциплинарноеВзыскание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
				<xr:Item>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</xr:Item>
				<xr:Item>InformationRegister.БухучетНачисленийСотрудников</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Взыскание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьНаставничество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наставники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставляемый</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеНаставника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтменитьДоплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СовокупнаяТарифнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СнятиеДисциплинарногоВзыскания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Сотрудники.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.СнятиеДисциплинарногоВзыскания;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СнятиеДисциплинарногоВзыскания.ДатаСнятия КАК Период,
		|	СнятиеДисциплинарногоВзыскания.ДатаНачала КАК ДатаНачала,
		|	СнятиеДисциплинарногоВзыскания.ДатаСнятия КАК ДатаОкончания,
		|	СнятиеДисциплинарногоВзыскания.Сотрудник КАК Сотрудник,
		|	СнятиеДисциплинарногоВзыскания.Взыскание КАК Взыскание,
		|	СнятиеДисциплинарногоВзыскания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументСнятияДисциплинарногоВзыскания.Организация КАК Организация
		|ИЗ
		|	Документ.СнятиеДисциплинарногоВзыскания.Сотрудники КАК СнятиеДисциплинарногоВзыскания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СнятиеДисциплинарногоВзыскания КАК ДокументСнятияДисциплинарногоВзыскания
		|		ПО СнятиеДисциплинарногоВзыскания.Ссылка = ДокументСнятияДисциплинарногоВзыскания.Ссылка
		|ГДЕ
		|	ДокументСнятияДисциплинарногоВзыскания.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ДанныеДляПроведения = Новый Структура("ДвиженияДисциплинарногоВзыскания", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.СнятиеДисциплинарногоВзыскания";
	КомандаПечати.Идентификатор = Метаданные.Документы.СнятиеДисциплинарногоВзыскания.Макеты.ПФ_MXL_СнятиеДисциплинарныхВзысканий.Имя;
	КомандаПечати.Представление = Метаданные.Документы.СнятиеДисциплинарногоВзыскания.Макеты.ПФ_MXL_СнятиеДисциплинарныхВзысканий.Представление();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.СнятиеДисциплинарногоВзыскания";
	КомандаПечати.Идентификатор = Метаданные.Документы.СнятиеДисциплинарногоВзыскания.Макеты.ПФ_MXL_СнятиеДисциплинарногоВзыскания.Имя;
	КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВсехПриказов", Истина);
	КомандаПечати.Представление = НСтр("ru = 'Приказы на каждого сотрудника в отдельности'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  Для чтения:
//    МассивОбъектов  - Массив    - Ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - Настройки печати;
//  Для изменения:
//    КоллекцияПечатныхФорм - ТаблицаЗначений - Табличные документы.
//    ОбъектыПечати         - СписокЗначений  - Разбивка областей табличного документа по напечатанным объектам.
//        * Значение            - Ссылка объекта;
//        * Представление       - Имя области в которой был выведен объект;
//    ПараметрыВывода       - Структура       - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатьюБЗК.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, Документы.СнятиеДисциплинарногоВзыскания);
	
КонецПроцедуры

// Формирует печатную форму. Вызывается из УправлениеПечатьюБЗК.Печать.
//
// Параметры:
//   КонтекстПечати - Структура - См. УправлениеПечатьюБЗК.КонтекстПечати.
//
Процедура ПриФормированииПечатнойФормы(КонтекстПечати) Экспорт
	
	Если КонтекстПечати.МетаданныеМакета = Метаданные.Документы.СнятиеДисциплинарногоВзыскания.Макеты.ПФ_MXL_СнятиеДисциплинарныхВзысканий Тогда
		ПриПечатиСнятияДисциплинарныхВзысканий(КонтекстПечати);
	ИначеЕсли КонтекстПечати.МетаданныеМакета = Метаданные.Документы.СнятиеДисциплинарногоВзыскания.Макеты.ПФ_MXL_СнятиеДисциплинарногоВзыскания Тогда
		ПриПечатиСнятияДисциплинарногоВзыскания(КонтекстПечати);
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеДляПечатиСнятияДисциплинарныхВзысканий(МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументСнятияДисциплинарногоВзыскания.Ссылка КАК Ссылка,
		|	ДокументСнятияДисциплинарногоВзыскания.Номер КАК НомерДок,
		|	ДокументСнятияДисциплинарногоВзыскания.Дата КАК Дата,
		|	ДокументСнятияДисциплинарногоВзыскания.Дата КАК Период,
		|	ДокументСнятияДисциплинарногоВзыскания.Дата КАК ДатаДок,
		|	ДокументДисциплинарноеВзыскание.Номер КАК НомерДокОснование,
		|	ДокументДисциплинарноеВзыскание.Дата КАК ДатаДокОснование,
		|	ДокументСнятияДисциплинарногоВзыскания.Организация КАК Организация,
		|	ДокументСнятияДисциплинарногоВзыскания.Руководитель КАК Руководитель,
		|	ДокументСнятияДисциплинарногоВзыскания.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ДокументСнятияДисциплинарногоВзыскания.РаботникКадровойСлужбы КАК РаботникКадровойСлужбы,
		|	ДокументСнятияДисциплинарногоВзыскания.ДолжностьРаботникаКадровойСлужбы КАК ДолжностьРаботникаКадровойСлужбы,
		|	СнятиеДисциплинарногоВзыскания.Сотрудник КАК Сотрудник,
		|	СнятиеДисциплинарногоВзыскания.ДатаСнятия КАК ДатаСнятияВзыскания
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.СнятиеДисциплинарногоВзыскания.Сотрудники КАК СнятиеДисциплинарногоВзыскания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СнятиеДисциплинарногоВзыскания КАК ДокументСнятияДисциплинарногоВзыскания
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание КАК ДокументДисциплинарноеВзыскание
		|			ПО ДокументСнятияДисциплинарногоВзыскания.ДокументОснование = ДокументДисциплинарноеВзыскание.Ссылка
		|		ПО СнятиеДисциплинарногоВзыскания.Ссылка = ДокументСнятияДисциплинарногоВзыскания.Ссылка
		|ГДЕ
		|	ДокументСнятияДисциплинарногоВзыскания.Ссылка В(&МассивСсылок)";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТДанныеДокументов");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "ФИОПолные,Должность");
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, "Руководитель,РаботникКадровойСлужбы", "ВТДанныеДокументов");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.НомерДок КАК НомерДок,
		|	ДанныеДокументов.ДатаДок КАК ДатаДок,
		|	ДанныеДокументов.НомерДокОснование КАК НомерДокОснование,
		|	ДанныеДокументов.ДатаДокОснование КАК ДатаДокОснование,
		|	ДанныеДокументов.ДатаСнятияВзыскания КАК ДатаСнятияВзыскания,
		|	СправочникОрганизации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	СправочникОрганизации.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
		|	КадровыеДанныеСотрудников.ФИОПолные КАК ФИОРаботника,
		|	СправочникДолжности.Наименование КАК ДолжностьРаботника,
		|	ДанныеДокументов.Руководитель КАК Руководитель,
		|	ДанныеДокументов.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ФИОРуководителя.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи,
		|	ФИОИсполнителя.ФИОПолные КАК ФИОИсполнителя,
		|	ДанныеДокументов.РаботникКадровойСлужбы КАК РаботникКадровойСлужбы,
		|	ДанныеДокументов.ДолжностьРаботникаКадровойСлужбы КАК ДолжностьИсполнителя,
		|	ВЫРАЗИТЬ(ДанныеДокументов.РаботникКадровойСлужбы КАК Справочник.ФизическиеЛица).Пол КАК ПолИсполнителя
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК СправочникДолжности
		|			ПО КадровыеДанныеСотрудников.Должность = СправочникДолжности.Ссылка
		|		ПО ДанныеДокументов.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И ДанныеДокументов.Период = КадровыеДанныеСотрудников.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
		|		ПО ДанныеДокументов.Ссылка = ФИОРуководителя.Ссылка
		|			И ДанныеДокументов.Руководитель = ФИОРуководителя.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОИсполнителя
		|		ПО ДанныеДокументов.Ссылка = ФИОИсполнителя.Ссылка
		|			И ДанныеДокументов.РаботникКадровойСлужбы = ФИОИсполнителя.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникОрганизации
		|		ПО ДанныеДокументов.Организация = СправочникОрганизации.Ссылка";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ПриПечатиСнятияДисциплинарныхВзысканий(КонтекстПечати)
	
	ТабличныйДокумент = КонтекстПечати.ТабличныйДокумент;
	МассивОбъектов    = КонтекстПечати.МассивОбъектов;
	ОбъектыПечати     = КонтекстПечати.ОбъектыПечати;
	
	ДанныеДляПечати = ДанныеДляПечатиСнятияДисциплинарныхВзысканий(МассивОбъектов);
	Пока ДанныеДляПечати.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НачалоФормы = ТабличныйДокумент.ВысотаТаблицы - 1;
		НомерПункта = 1;
		
		ВывестиШапкуСнятияДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати);
		
		Пока ДанныеДляПечати.Следующий() Цикл
			
			ВывестиПунктСнятияДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта);
			
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;
		
		ВывестиПодвалСнятияДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НачалоФормы, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВывестиШапкуСнятияДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати)
	
	НастройкиПечатныхФорм = ЗарплатаКадры.НастройкиПечатныхФорм();
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыШапки = Новый Структура(ИменаПараметровОбластей.Шапка);
	ЗаполнитьЗначенияСвойств(ПараметрыШапки, ДанныеДляПечати);
	
	Если НастройкиПечатныхФорм.УдалятьПрефиксыОрганизацииИИБИзНомеровКадровыхПриказов Тогда
		ПараметрыШапки.НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыШапки.НомерДок, Истина, Истина);
		ПараметрыШапки.НомерДокОснование = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыШапки.НомерДокОснование, Истина, Истина);
	КонецЕсли;
	
	ПараметрыШапки.ДатаДок = Формат(ПараметрыШапки.ДатаДок, "ДЛФ=DD");
	ПараметрыШапки.ДатаДокОснование = Формат(ПараметрыШапки.ДатаДокОснование, "ДЛФ=DD");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
КонецФункции

Функция ВывестиПунктСнятияДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПункта = Новый Структура(ИменаПараметровОбластей.Снятие);
	ЗаполнитьЗначенияСвойств(ПараметрыПункта, ДанныеДляПечати);
	
	ПараметрыПункта.НомерПункта = НомерПункта;
	ПараметрыПункта.ДолжностьРаботника = СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеДляПечати.ДолжностьРаботника), 2, ДанныеДляПечати.ДолжностьРаботника);
	
	РезультатСклонения = "";
	Если ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеДляПечати.ФИОРаботника), 2, РезультатСклонения) Тогда
		ПараметрыПункта.ФИОРаботника = РезультатСклонения;
	КонецЕсли;
	
	ПараметрыПункта.ДатаСнятияВзыскания = Формат(ПараметрыПункта.ДатаСнятияВзыскания, "ДЛФ=DD");
	
	ОбластьСнятие = Макет.ПолучитьОбласть("Снятие");
	ОбластьСнятие.Параметры.Заполнить(ПараметрыПункта);
	ТабличныйДокумент.Вывести(ОбластьСнятие);
	
КонецФункции

Функция ВывестиПодвалСнятияДисциплинарныхВзысканий(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПодвала = Новый Структура(ИменаПараметровОбластей.Подвал);
	ЗаполнитьЗначенияСвойств(ПараметрыПодвала, ДанныеДляПечати);
	
	ПараметрыПодвала.НомерПункта = НомерПункта;
	
	Если ЗначениеЗаполнено(ПараметрыПодвала.ФИОИсполнителя) Тогда
		РезультатСклонения = "";
		Если ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ПараметрыПодвала.ФИОИсполнителя), 4, РезультатСклонения, ДанныеДляПечати.ПолИсполнителя) Тогда
			ПараметрыПодвала.ФИОИсполнителя = РезультатСклонения;
		КонецЕсли;
	Иначе
		ПараметрыПодвала.ФИОИсполнителя = "____________________";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыПодвала.ДолжностьИсполнителя) Тогда
		ПараметрыПодвала.ДолжностьИсполнителя = "____________________";
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецФункции

Процедура ПриПечатиСнятияДисциплинарногоВзыскания(КонтекстПечати)
	
	ТабличныйДокумент = КонтекстПечати.ТабличныйДокумент;
	МассивОбъектов    = КонтекстПечати.МассивОбъектов;
	ОбъектыПечати     = КонтекстПечати.ОбъектыПечати;
	
	ДанныеДляПечати = ДанныеДляПечатиСнятияДисциплинарныхВзысканий(МассивОбъектов);
	Пока ДанныеДляПечати.Следующий() Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НачалоФормы = ТабличныйДокумент.ВысотаТаблицы - 1;
		НомерПункта = 1;
		
		ВывестиШапкуСнятияДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати);
			
		ВывестиПунктСнятияДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта);
		НомерПункта = НомерПункта + 1;
		
		ВывестиПодвалСнятияДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НачалоФормы, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВывестиШапкуСнятияДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати)
	
	НастройкиПечатныхФорм = ЗарплатаКадры.НастройкиПечатныхФорм();
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыШапки = Новый Структура(ИменаПараметровОбластей.Шапка);
	ЗаполнитьЗначенияСвойств(ПараметрыШапки, ДанныеДляПечати);
	
	Если НастройкиПечатныхФорм.УдалятьПрефиксыОрганизацииИИБИзНомеровКадровыхПриказов Тогда
		ПараметрыШапки.НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыШапки.НомерДок, Истина, Истина);
	КонецЕсли;
	
	ПараметрыШапки.ДатаДок = Формат(ПараметрыШапки.ДатаДок, "ДЛФ=DD");
	ПараметрыШапки.ДолжностьРаботника = СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеДляПечати.ДолжностьРаботника), 2, ДанныеДляПечати.ДолжностьРаботника);
	
	РезультатСклонения = "";
	Если ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеДляПечати.ФИОРаботника), 2, РезультатСклонения) Тогда
		ПараметрыШапки.ФИОРаботника = РезультатСклонения;
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
КонецФункции

Функция ВывестиПунктСнятияДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	НастройкиПечатныхФорм = ЗарплатаКадры.НастройкиПечатныхФорм();
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПункта = Новый Структура(ИменаПараметровОбластей.Снятие);
	ЗаполнитьЗначенияСвойств(ПараметрыПункта, ДанныеДляПечати);
	
	ПараметрыПункта.НомерПункта = НомерПункта;
	
	Если НастройкиПечатныхФорм.УдалятьПрефиксыОрганизацииИИБИзНомеровКадровыхПриказов Тогда
		ПараметрыПункта.НомерДокОснование = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыПункта.НомерДокОснование, Истина, Истина);
	КонецЕсли;
	
	ПараметрыПункта.ДатаДокОснование = Формат(ПараметрыПункта.ДатаДокОснование, "ДЛФ=DD");
	ПараметрыПункта.ДатаСнятияВзыскания = Формат(ПараметрыПункта.ДатаСнятияВзыскания, "ДЛФ=DD");
	
	ОбластьСнятие = Макет.ПолучитьОбласть("Снятие");
	ОбластьСнятие.Параметры.Заполнить(ПараметрыПункта);
	ТабличныйДокумент.Вывести(ОбластьСнятие);
	
КонецФункции

Функция ВывестиПодвалСнятияДисциплинарногоВзыскания(КонтекстПечати, ДанныеДляПечати, НомерПункта)
	
	ТабличныйДокумент       = КонтекстПечати.ТабличныйДокумент;
	Макет                   = КонтекстПечати.Макет;
	ИменаПараметровОбластей = КонтекстПечати.ИменаПараметровОбластей;
	
	ПараметрыПодвала = Новый Структура(ИменаПараметровОбластей.Подвал);
	ЗаполнитьЗначенияСвойств(ПараметрыПодвала, ДанныеДляПечати);
	
	ПараметрыПодвала.НомерПункта = НомерПункта;
	
	Если ЗначениеЗаполнено(ПараметрыПодвала.ФИОИсполнителя) Тогда
		РезультатСклонения = "";
		Если ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ПараметрыПодвала.ФИОИсполнителя), 4, РезультатСклонения, ДанныеДляПечати.ПолИсполнителя) Тогда
			ПараметрыПодвала.ФИОИсполнителя = РезультатСклонения;
		КонецЕсли;
	Иначе
		ПараметрыПодвала.ФИОИсполнителя = "____________________";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыПодвала.ДолжностьИсполнителя) Тогда
		ПараметрыПодвала.ДолжностьИсполнителя = "____________________";
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
